package ru.kborodulin.task5;

import java.util.Arrays;

/**
 * Реализовать программу «Вендинговый автомат», которая позволит:
 * <p>
 * Посмотреть меню напитков
 * Внести деньги на внутренний счет
 * Выбрать номер напитка и получить его, если на счету достаточно средств.
 * <p>
 * Программа должна обрабатывать следующие ситуации:
 * <p>
 * Пользователь не внес деньги
 * Пользователь выбрал более дорогой напиток, чем внесено денег
 * Пользователь выбрал несуществующий номер напитка
 * <p>
 * Для хранения напитков предлагается использовать массив с enum (или с обычным классом). У напитка должна быть цена и название.
 */

public class App {
    public static void main(String[] args) throws Exception {
        // Создаем вендинговую машину и загружаем список напитков
        VendingMachine vm = new VendingMachine(Arrays.asList(Drink.values()));

        // Распечатаем загруженный список (меню)
        vm.showDrinks(vm.getListDrinks());

        // Внесем деньги
        double money = vm.addMoney();

        // Выберем номер напитка
        int keyDrink = vm.giveNumDrink();

        // Выдадим напиток
        vm.giveDrink();

        // Вернем сдачу
        vm.cashBack();
    }
}
